Documents/ВводСведенийОПлановыхНачисленияхРаботниковОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Document>
		<Properties>
			<Name>ВводСведенийОПлановыхНачисленияхРаботниковОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<BasedOn>
				<xr:Item>Catalog.СотрудникиОрганизаций</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПлановыеНачисленияРаботниковОрганизаций</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОсновныеНачисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРасчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.ОсновныеНачисленияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Действие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыДействияСНачислением</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаДействия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаДействияКонец</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показатель1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показатель2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показатель3</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показатель4</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта1</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта3</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта4</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифныйРазряд1</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТарифныеРазряды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифныйРазряд2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТарифныеРазряды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифныйРазряд3</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТарифныеРазряды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифныйРазряд4</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТарифныеРазряды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьПриказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПриемНаРаботуВОрганизацию</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показатель5</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показатель6</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта5</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта6</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифныйРазряд5</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТарифныеРазряды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифныйРазряд6</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТарифныеРазряды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УдалитьДополнительныеНачисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРасчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.ДополнительныеНачисленияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Действие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыДействияСНачислением</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаДействия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаДействияКонец</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показатель1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта1</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифныйРазряд1</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТарифныеРазряды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументОснование</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ДоговорНаВыполнениеРаботСФизЛицом</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьПриказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПриемНаРаботуВОрганизацию</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/РазмерТарифныхСтавок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>РазмерТарифныхСтавок</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТарифныйРазряд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеРазряды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыДействияСНачислением.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>ВидыДействияСНачислением</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Начать</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Изменить</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеИзменять</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прекратить</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыТарифныхСтавок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>ВидыТарифныхСтавок</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Месячная</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дневная</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Часовая</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ВводСведенийОПлановыхНачисленияхРаботниковОрганизаций/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

Перем СоответствиеВалютныеСпособыРасчета;
Перем мДлинаСуток;

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Добавляет строки в таблицы начислений на основе данных регистра сведений "ПлановыеНачисленияРаботниковОрганизаций"
//
// Параметры
//
Процедура ДобавитьСтрокиНачисленийПоРаботнику(Сотрудник, ДатаАктуальности = Неопределено) Экспорт
	
	ГоловнаяОрганизация = ОбщегоНазначения.ГоловнаяОрганизация(Организация);
	Если ДатаАктуальности = Неопределено Тогда
		ДатаАктуальности = Дата
	КонецЕсли;
	
	ЗапросНачисления = Новый Запрос;
	ЗапросНачисления.УстановитьПараметр("Сотрудник", Сотрудник);
	ЗапросНачисления.УстановитьПараметр("Организация", ГоловнаяОрганизация);
	ЗапросНачисления.УстановитьПараметр("Период",  ДатаАктуальности);
	ЗапросНачисления.УстановитьПараметр("Регистратор", Ссылка);
	ЗапросНачисления.УстановитьПараметр("Прекратить", Перечисления.ВидыДействияСНачислением.Прекратить);
	
	ЗапросНачисления.Текст =
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Начисления.ВидРасчета ССЫЛКА ПланВидовРасчета.ОсновныеНачисленияОрганизаций
	|			ТОГДА ""Основные""
	|		ИНАЧЕ ""Дополнительные""
	|	КОНЕЦ КАК ВидНачислений,
	|	Начисления.Сотрудник,
	|	Начисления.Сотрудник.Физлицо КАК Физлицо,
	|	Начисления.ДокументОснование,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= &Период
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА Начисления.ВидРасчетаЗавершения
	|		ИНАЧЕ Начисления.ВидРасчета
	|	КОНЕЦ КАК ВидРасчета,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= &Период
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ВЫБОР
	|					КОГДА Начисления.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
	|						ТОГДА НЕОПРЕДЕЛЕНО
	|					ИНАЧЕ Начисления.Показатель1Завершения
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Начисления.ВидРасчета.ТребуетВводаТарифногоРазряда
	|					ТОГДА НЕОПРЕДЕЛЕНО
	|				ИНАЧЕ Начисления.Показатель1
	|			КОНЕЦ
	|	КОНЕЦ КАК Показатель1,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= &Период
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ВЫБОР
	|					КОГДА Начисления.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
	|						ТОГДА НЕОПРЕДЕЛЕНО
	|					ИНАЧЕ Начисления.Показатель2Завершения
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Начисления.ВидРасчета.ТребуетВводаТарифногоРазряда
	|					ТОГДА НЕОПРЕДЕЛЕНО
	|				ИНАЧЕ Начисления.Показатель2
	|			КОНЕЦ
	|	КОНЕЦ КАК Показатель2,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= &Период
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ВЫБОР
	|					КОГДА Начисления.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
	|						ТОГДА НЕОПРЕДЕЛЕНО
	|					ИНАЧЕ Начисления.Показатель3Завершения
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Начисления.ВидРасчета.ТребуетВводаТарифногоРазряда
	|					ТОГДА НЕОПРЕДЕЛЕНО
	|				ИНАЧЕ Начисления.Показатель3
	|			КОНЕЦ
	|	КОНЕЦ КАК Показатель3,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= &Период
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ВЫБОР
	|					КОГДА Начисления.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
	|						ТОГДА НЕОПРЕДЕЛЕНО
	|					ИНАЧЕ Начисления.Показатель4Завершения
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Начисления.ВидРасчета.ТребуетВводаТарифногоРазряда
	|					ТОГДА НЕОПРЕДЕЛЕНО
	|				ИНАЧЕ Начисления.Показатель4
	|			КОНЕЦ
	|	КОНЕЦ КАК Показатель4,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= &Период
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ВЫБОР
	|					КОГДА Начисления.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
	|						ТОГДА НЕОПРЕДЕЛЕНО
	|					ИНАЧЕ Начисления.Показатель5Завершения
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Начисления.ВидРасчета.ТребуетВводаТарифногоРазряда
	|					ТОГДА НЕОПРЕДЕЛЕНО
	|				ИНАЧЕ Начисления.Показатель5
	|			КОНЕЦ
	|	КОНЕЦ КАК Показатель5,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= &Период
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ВЫБОР
	|					КОГДА Начисления.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
	|						ТОГДА НЕОПРЕДЕЛЕНО
	|					ИНАЧЕ Начисления.Показатель6Завершения
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Начисления.ВидРасчета.ТребуетВводаТарифногоРазряда
	|					ТОГДА НЕОПРЕДЕЛЕНО
	|				ИНАЧЕ Начисления.Показатель6
	|			КОНЕЦ
	|	КОНЕЦ КАК Показатель6,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= &Период
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ВЫБОР
	|					КОГДА Начисления.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
	|						ТОГДА Начисления.ТарифныйРазряд1Завершения
	|					ИНАЧЕ НЕОПРЕДЕЛЕНО
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Начисления.ВидРасчета.ТребуетВводаТарифногоРазряда
	|					ТОГДА Начисления.ТарифныйРазряд1
	|				ИНАЧЕ НЕОПРЕДЕЛЕНО
	|			КОНЕЦ
	|	КОНЕЦ КАК ТарифныйРазряд1,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= &Период
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ВЫБОР
	|					КОГДА Начисления.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
	|						ТОГДА Начисления.ТарифныйРазряд2Завершения
	|					ИНАЧЕ НЕОПРЕДЕЛЕНО
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Начисления.ВидРасчета.ТребуетВводаТарифногоРазряда
	|					ТОГДА Начисления.ТарифныйРазряд2
	|				ИНАЧЕ НЕОПРЕДЕЛЕНО
	|			КОНЕЦ
	|	КОНЕЦ КАК ТарифныйРазряд2,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= &Период
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ВЫБОР
	|					КОГДА Начисления.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
	|						ТОГДА Начисления.ТарифныйРазряд3Завершения
	|					ИНАЧЕ НЕОПРЕДЕЛЕНО
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Начисления.ВидРасчета.ТребуетВводаТарифногоРазряда
	|					ТОГДА Начисления.ТарифныйРазряд3
	|				ИНАЧЕ НЕОПРЕДЕЛЕНО
	|			КОНЕЦ
	|	КОНЕЦ КАК ТарифныйРазряд3,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= &Период
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ВЫБОР
	|					КОГДА Начисления.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
	|						ТОГДА Начисления.ТарифныйРазряд4Завершения
	|					ИНАЧЕ НЕОПРЕДЕЛЕНО
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Начисления.ВидРасчета.ТребуетВводаТарифногоРазряда
	|					ТОГДА Начисления.ТарифныйРазряд4
	|				ИНАЧЕ НЕОПРЕДЕЛЕНО
	|			КОНЕЦ
	|	КОНЕЦ КАК ТарифныйРазряд4,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= &Период
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ВЫБОР
	|					КОГДА Начисления.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
	|						ТОГДА Начисления.ТарифныйРазряд5Завершения
	|					ИНАЧЕ НЕОПРЕДЕЛЕНО
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Начисления.ВидРасчета.ТребуетВводаТарифногоРазряда
	|					ТОГДА Начисления.ТарифныйРазряд5
	|				ИНАЧЕ НЕОПРЕДЕЛЕНО
	|			КОНЕЦ
	|	КОНЕЦ КАК ТарифныйРазряд5,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= &Период
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ВЫБОР
	|					КОГДА Начисления.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
	|						ТОГДА Начисления.ТарифныйРазряд6Завершения
	|					ИНАЧЕ НЕОПРЕДЕЛЕНО
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Начисления.ВидРасчета.ТребуетВводаТарифногоРазряда
	|					ТОГДА Начисления.ТарифныйРазряд6
	|				ИНАЧЕ НЕОПРЕДЕЛЕНО
	|			КОНЕЦ
	|	КОНЕЦ КАК ТарифныйРазряд6,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= &Период
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА Начисления.Валюта1Завершения
	|		ИНАЧЕ Начисления.Валюта1
	|	КОНЕЦ КАК Валюта1,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= &Период
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА Начисления.Валюта2Завершения
	|		ИНАЧЕ Начисления.Валюта2
	|	КОНЕЦ КАК Валюта2,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= &Период
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА Начисления.Валюта3Завершения
	|		ИНАЧЕ Начисления.Валюта3
	|	КОНЕЦ КАК Валюта3,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= &Период
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА Начисления.Валюта4Завершения
	|		ИНАЧЕ Начисления.Валюта4
	|	КОНЕЦ КАК Валюта4,	
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= &Период
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА Начисления.Валюта5Завершения
	|		ИНАЧЕ Начисления.Валюта5
	|	КОНЕЦ КАК Валюта5,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= &Период
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА Начисления.Валюта6Завершения
	|		ИНАЧЕ Начисления.Валюта6
	|	КОНЕЦ КАК Валюта6
	|ИЗ
	|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(
	|		&Период,
	|		Сотрудник = &Сотрудник
	|			И Регистратор <> &Регистратор) КАК Начисления
	|ГДЕ
	|	Начисления.ВидРасчета.Код ЕСТЬ НЕ NULL 
	|	И ВЫБОР
	|			КОГДА Начисления.ПериодЗавершения <= &Период
	|					И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА Начисления.ДействиеЗавершения
	|			ИНАЧЕ Начисления.Действие
	|		КОНЕЦ <> &Прекратить";

	Выборка = ЗапросНачисления.Выполнить().Выбрать();
	
	СтруктураПоиска = Новый Структура("Сотрудник, ВидРасчета, Действие");
	СтруктураПоиска.Действие   = Перечисления.ВидыДействияСНачислением.НеИзменять;
	
	Пока Выборка.Следующий() Цикл
		
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, Выборка);
		МассивНачислений = ОсновныеНачисления.НайтиСтроки(СтруктураПоиска);
		
		Если МассивНачислений.Количество() <> 0 Тогда
			Продолжить;
		КонецЕсли;

		НоваяСтрокаТЧ	= ОсновныеНачисления.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТЧ,Выборка);
		НоваяСтрокаТЧ.Действие		= Перечисления.ВидыДействияСНачислением.НеИзменять;
		НоваяСтрокаТЧ.ДатаДействия	= ДатаАктуальности;
		
	КонецЦикла;

КонецПроцедуры // ДобавитьСтрокиНачисленийПоРаботнику()

// Удаляет строки начислений по РаботникиОрганизации
//
Процедура УдалитьСтрокиНачисленийПоРаботнику(Сотрудник) Экспорт
	
	СтруктураПоиска = Новый Структура("Сотрудник", Сотрудник);
	
	МассивСтрок = ОсновныеНачисления.НайтиСтроки(СтруктураПоиска);
	Для каждого СтрокаТабличнойЧасти Из МассивСтрок Цикл
		ОсновныеНачисления.Удалить(СтрокаТабличнойЧасти);
	КонецЦикла;
	
КонецПроцедуры // УдалитьСтрокиНачисленийПоРаботнику()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Формирует запрос по шапке документа
//
// Параметры: 
//  Режим - режим проведения
//
// Возвращаемое значение:
//  Результат запроса
//
Функция СформироватьЗапросПоШапке(Режим)

	Запрос = Новый Запрос;

	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка",		Ссылка);
	Запрос.УстановитьПараметр("ПустаяОрганизация",	Справочники.Организации.ПустаяСсылка());

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВводСведенийОПлановыхНачисленияхРаботниковОрганизаций.Дата,
	|	ВводСведенийОПлановыхНачисленияхРаботниковОрганизаций.Организация,
	|	ВЫБОР
	|		КОГДА ВводСведенийОПлановыхНачисленияхРаботниковОрганизаций.Организация.ГоловнаяОрганизация = &ПустаяОрганизация
	|			ТОГДА ВводСведенийОПлановыхНачисленияхРаботниковОрганизаций.Организация
	|		ИНАЧЕ ВводСведенийОПлановыхНачисленияхРаботниковОрганизаций.Организация.ГоловнаяОрганизация
	|	КОНЕЦ КАК ГоловнаяОрганизация,
	|	ВводСведенийОПлановыхНачисленияхРаботниковОрганизаций.Ссылка
	|ИЗ
	|	Документ.ВводСведенийОПлановыхНачисленияхРаботниковОрганизаций КАК ВводСведенийОПлановыхНачисленияхРаботниковОрганизаций
	|ГДЕ
	|	ВводСведенийОПлановыхНачисленияхРаботниковОрганизаций.Ссылка = &ДокументСсылка";

	Возврат Запрос.Выполнить();

КонецФункции // СформироватьЗапросПоШапке()

// Формирует запрос по таблице "РаботникиОрганизации" документа
//
// Параметры: 
//  Режим - режим проведения
//
// Возвращаемое значение:
//  Результат запроса. В запросе данные документа дополняются значениями
//  проверяемых параметров из связанного с
//
Функция СформироватьЗапросПоРаботникиОрганизации(ВыборкаПоШапкеДокумента, ПроверкаШтатногоРасписания)

	Запрос = Новый Запрос;
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка",			Ссылка);
	Запрос.УстановитьПараметр("ГоловнаяОрганизация",	ВыборкаПоШапкеДокумента.ГоловнаяОрганизация);
	
	// получим временную таблицу с расчетом показателей
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТЧОсновныеНачисления.ВидРасчета КАК ВидРасчета,
	|	МАКСИМУМ(Показатели.НомерСтроки) КАК КоличествоПоказателей,
	|	Показатели1.Показатель.Предопределенный КАК Показатель1Предопределенный,
	|	Показатели1.Показатель.Наименование КАК Показатель1Наименование,
	|	Показатели1.Показатель.ТипПоказателя КАК Показатель1ТипПоказателя,
	|	Показатели1.Показатель.ВозможностьИзменения КАК Показатель1ВозможностьИзменения,
	|	Показатели2.Показатель.Предопределенный КАК Показатель2Предопределенный,
	|	Показатели2.Показатель.Наименование КАК Показатель2Наименование,
	|	Показатели2.Показатель.ТипПоказателя КАК Показатель2ТипПоказателя,
	|	Показатели2.Показатель.ВозможностьИзменения КАК Показатель2ВозможностьИзменения,
	|	Показатели3.Показатель.Предопределенный КАК Показатель3Предопределенный,
	|	Показатели3.Показатель.Наименование КАК Показатель3Наименование,
	|	Показатели3.Показатель.ТипПоказателя КАК Показатель3ТипПоказателя,
	|	Показатели3.Показатель.ВозможностьИзменения КАК Показатель3ВозможностьИзменения,
	|	Показатели4.Показатель.Предопределенный КАК Показатель4Предопределенный,
	|	Показатели4.Показатель.Наименование КАК Показатель4Наименование,
	|	Показатели4.Показатель.ТипПоказателя КАК Показатель4ТипПоказателя,
	|	Показатели4.Показатель.ВозможностьИзменения КАК Показатель4ВозможностьИзменения,
	|	Показатели5.Показатель.Предопределенный КАК Показатель5Предопределенный,
	|	Показатели5.Показатель.Наименование КАК Показатель5Наименование,
	|	Показатели5.Показатель.ТипПоказателя КАК Показатель5ТипПоказателя,
	|	Показатели5.Показатель.ВозможностьИзменения КАК Показатель5ВозможностьИзменения,
	|	Показатели6.Показатель.Предопределенный КАК Показатель6Предопределенный,
	|	Показатели6.Показатель.Наименование КАК Показатель6Наименование,
	|	Показатели6.Показатель.ТипПоказателя КАК Показатель6ТипПоказателя,
	|	Показатели6.Показатель.ВозможностьИзменения КАК Показатель6ВозможностьИзменения,
	|	Показатели1.ЗапрашиватьПриКадровыхПеремещениях КАК Показатель1ЗапрашиватьПриКадровыхПеремещениях,
	|	Показатели2.ЗапрашиватьПриКадровыхПеремещениях КАК Показатель2ЗапрашиватьПриКадровыхПеремещениях,
	|	Показатели3.ЗапрашиватьПриКадровыхПеремещениях КАК Показатель3ЗапрашиватьПриКадровыхПеремещениях,
	|	Показатели4.ЗапрашиватьПриКадровыхПеремещениях КАК Показатель4ЗапрашиватьПриКадровыхПеремещениях,
	|	Показатели5.ЗапрашиватьПриКадровыхПеремещениях КАК Показатель5ЗапрашиватьПриКадровыхПеремещениях,
	|	Показатели6.ЗапрашиватьПриКадровыхПеремещениях КАК Показатель6ЗапрашиватьПриКадровыхПеремещениях,
	|	Показатели1.Показатель.ТарифнаяСтавка КАК Показатель1ТарифнаяСтавка,
	|	Показатели2.Показатель.ТарифнаяСтавка КАК Показатель2ТарифнаяСтавка,
	|	Показатели3.Показатель.ТарифнаяСтавка КАК Показатель3ТарифнаяСтавка,
	|	Показатели4.Показатель.ТарифнаяСтавка КАК Показатель4ТарифнаяСтавка,
	|	Показатели5.Показатель.ТарифнаяСтавка КАК Показатель5ТарифнаяСтавка,
	|	Показатели6.Показатель.ТарифнаяСтавка КАК Показатель6ТарифнаяСтавка
	|ПОМЕСТИТЬ ВТПоказатели
	|ИЗ
	|	Документ.ВводСведенийОПлановыхНачисленияхРаботниковОрганизаций.ОсновныеНачисления КАК ТЧОсновныеНачисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ОсновныеНачисленияОрганизаций.Показатели КАК Показатели
	|		ПО ТЧОсновныеНачисления.ВидРасчета = Показатели.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ОсновныеНачисленияОрганизаций.Показатели КАК Показатели1
	|		ПО ТЧОсновныеНачисления.ВидРасчета = Показатели1.Ссылка
	|			И (Показатели1.НомерСтроки = 1)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ОсновныеНачисленияОрганизаций.Показатели КАК Показатели2
	|		ПО ТЧОсновныеНачисления.ВидРасчета = Показатели2.Ссылка
	|			И (Показатели2.НомерСтроки = 2)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ОсновныеНачисленияОрганизаций.Показатели КАК Показатели3
	|		ПО ТЧОсновныеНачисления.ВидРасчета = Показатели3.Ссылка
	|			И (Показатели3.НомерСтроки = 3)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ОсновныеНачисленияОрганизаций.Показатели КАК Показатели4
	|		ПО ТЧОсновныеНачисления.ВидРасчета = Показатели4.Ссылка
	|			И (Показатели4.НомерСтроки = 4)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ОсновныеНачисленияОрганизаций.Показатели КАК Показатели5
	|		ПО ТЧОсновныеНачисления.ВидРасчета = Показатели5.Ссылка
	|			И (Показатели5.НомерСтроки = 5)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ОсновныеНачисленияОрганизаций.Показатели КАК Показатели6
	|		ПО ТЧОсновныеНачисления.ВидРасчета = Показатели6.Ссылка
	|			И (Показатели6.НомерСтроки = 6)
	|ГДЕ
	|	ТЧОсновныеНачисления.Ссылка = &ДокументСсылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ТЧОсновныеНачисления.ВидРасчета,
	|	Показатели1.Показатель,
	|	Показатели2.Показатель,
	|	Показатели3.Показатель,
	|	Показатели4.Показатель,
	|	Показатели5.Показатель,
	|	Показатели6.Показатель,
	|	Показатели1.ЗапрашиватьПриКадровыхПеремещениях,
	|	Показатели2.ЗапрашиватьПриКадровыхПеремещениях,
	|	Показатели3.ЗапрашиватьПриКадровыхПеремещениях,
	|	Показатели4.ЗапрашиватьПриКадровыхПеремещениях,
	|	Показатели5.ЗапрашиватьПриКадровыхПеремещениях,
	|	Показатели6.ЗапрашиватьПриКадровыхПеремещениях,
	|	Показатели1.Показатель.Предопределенный,
	|	Показатели1.Показатель.Наименование,
	|	Показатели1.Показатель.ТипПоказателя,
	|	Показатели1.Показатель.ВозможностьИзменения,
	|	Показатели2.Показатель.Предопределенный,
	|	Показатели2.Показатель.Наименование,
	|	Показатели2.Показатель.ТипПоказателя,
	|	Показатели2.Показатель.ВозможностьИзменения,
	|	Показатели3.Показатель.Предопределенный,
	|	Показатели3.Показатель.Наименование,
	|	Показатели3.Показатель.ТипПоказателя,
	|	Показатели3.Показатель.ВозможностьИзменения,
	|	Показатели4.Показатель.Предопределенный,
	|	Показатели4.Показатель.Наименование,
	|	Показатели4.Показатель.ТипПоказателя,
	|	Показатели4.Показатель.ВозможностьИзменения,
	|	Показатели5.Показатель.Предопределенный,
	|	Показатели5.Показатель.Наименование,
	|	Показатели5.Показатель.ТипПоказателя,
	|	Показатели5.Показатель.ВозможностьИзменения,
	|	Показатели6.Показатель.Предопределенный,
	|	Показатели6.Показатель.Наименование,
	|	Показатели6.Показатель.ТипПоказателя,
	|	Показатели6.Показатель.ВозможностьИзменения,
	|	Показатели1.Показатель.ТарифнаяСтавка,
	|	Показатели2.Показатель.ТарифнаяСтавка,
	|	Показатели3.Показатель.ТарифнаяСтавка,
	|	Показатели4.Показатель.ТарифнаяСтавка,
	|	Показатели5.Показатель.ТарифнаяСтавка,
	|	Показатели6.Показатель.ТарифнаяСтавка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидРасчета";		

	Запрос.Выполнить();	
	
	ВТПоказатели = "ВТПоказатели";
	
	// Описание текста запроса:
	//
	// 1. Выборка "Начисления": 
	//		Выбираются строки ТЧ Начисления. Сразу проверяем наличие строк-дублей.  
	// 2. Выборка "СуществующиеДвижения": 
	//		Проверяем на наличие существующих конфликтных движений в регистре сведений. 
	
	Если ПроверкаШтатногоРасписания Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	Начисления.НомерСтроки,
		|	Начисления.Сотрудник,
		|	Начисления.Сотрудник.Наименование,
		|	Начисления.ВидРасчета,
		|	Начисления.ПроизвольнаяФормулаРасчета,
		|	Начисления.ДокументОснование,
		|	ЕСТЬNULL(Начисления.ТребуетВводаТарифногоРазряда, ЛОЖЬ) КАК ТребуетВводаТарифногоРазряда,
		|	Начисления.СпособРасчета,
		|	Начисления.ОсновноеНачисление,
		|	Начисления.Действие,
		|	Начисления.ДатаДействия,
		|	Начисления.ДатаДействияКонец,
		|	Начисления.ТарифныйРазряд1,
		|	Начисления.Показатель1,
		|	Начисления.Валюта1,
		|	Начисления.ТарифныйРазряд2,
		|	Начисления.Показатель2,
		|	Начисления.Валюта2,
		|	Начисления.ТарифныйРазряд3,
		|	Начисления.Показатель3,
		|	Начисления.Валюта3,
		|	Начисления.ТарифныйРазряд4,
		|	Начисления.Показатель4,
		|	Начисления.Валюта4,
		|	Начисления.ТарифныйРазряд5,
		|	Начисления.Показатель5,
		|	Начисления.Валюта5,
		|	Начисления.ТарифныйРазряд6,
		|	Начисления.Показатель6,
		|	Начисления.Валюта6,
		|	ЕСТЬNULL(Показатели.КоличествоПоказателей, 0) КАК КоличествоПоказателей,
		|	Показатели.Показатель1Предопределенный,
		|	Показатели.Показатель1Наименование,
		|	Показатели.Показатель1ТипПоказателя,
		|	Показатели.Показатель1ВозможностьИзменения,
		|	Показатели.Показатель2Предопределенный,
		|	Показатели.Показатель2Наименование,
		|	Показатели.Показатель2ТипПоказателя,
		|	Показатели.Показатель2ВозможностьИзменения,
		|	Показатели.Показатель3Предопределенный,
		|	Показатели.Показатель3Наименование,
		|	Показатели.Показатель3ТипПоказателя,
		|	Показатели.Показатель3ВозможностьИзменения,
		|	Показатели.Показатель4Предопределенный,
		|	Показатели.Показатель4Наименование,
		|	Показатели.Показатель4ТипПоказателя,
		|	Показатели.Показатель4ВозможностьИзменения,
		|	Показатели.Показатель5Предопределенный,
		|	Показатели.Показатель5Наименование,
		|	Показатели.Показатель5ТипПоказателя,
		|	Показатели.Показатель5ВозможностьИзменения,
		|	Показатели.Показатель6Предопределенный,
		|	Показатели.Показатель6Наименование,
		|	Показатели.Показатель6ТипПоказателя,
		|	Показатели.Показатель6ВозможностьИзменения,
		|	Показатели.Показатель1ТарифнаяСтавка,
		|	Показатели.Показатель2ТарифнаяСтавка,
		|	Показатели.Показатель3ТарифнаяСтавка,
		|	Показатели.Показатель4ТарифнаяСтавка,
		|	Показатели.Показатель5ТарифнаяСтавка,
		|	Показатели.Показатель6ТарифнаяСтавка,
		|	ВЫБОР
		|		КОГДА Начисления.Сотрудник.Организация = &ГоловнаяОрганизация
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ОшибкаНеСоответствиеСотрудникаИОрганизации,
		|	Начисления.КонфликтнаяСтрокаНомер,
		|	СуществующиеДвижения.Регистратор.Представление КАК КонфликтныйДокумент,
		|	ВЫБОР
		|		КОГДА Начисления.ОсновноеНачисление
		|				И Начисления.Действие В (ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Изменить), ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Начать))
		|			ТОГДА ВЫБОР
		|					КОГДА Начисления.ЗанимаемыхСтавок <> 1
		|						ТОГДА ИСТИНА
		|					КОГДА Начисления.СпособРасчета В (ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоЧасам), ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоДням))
		|							И Начисления.ВидТарифнойСтавки = ЗНАЧЕНИЕ(Перечисление.ВидыТарифныхСтавок.Месячная)
		|						ТОГДА ВЫБОР
		|								КОГДА Начисления.ТребуетВводаТарифногоРазряда
		|									ТОГДА ВЫБОР
		|											КОГДА Начисления.РазмерРазряда < Начисления.МинимальнаяТарифнаяСтавка
		|												ТОГДА ЛОЖЬ
		|											КОГДА Начисления.РазмерРазряда > Начисления.МаксимальнаяТарифнаяСтавка
		|												ТОГДА ЛОЖЬ
		|											ИНАЧЕ ИСТИНА
		|										КОНЕЦ
		|								ИНАЧЕ ВЫБОР
		|										КОГДА Начисления.Показатель1 < Начисления.МинимальнаяТарифнаяСтавка
		|											ТОГДА ЛОЖЬ
		|										КОГДА Начисления.Показатель1 > Начисления.МаксимальнаяТарифнаяСтавка
		|											ТОГДА ЛОЖЬ
		|										ИНАЧЕ ИСТИНА
		|									КОНЕЦ
		|							КОНЕЦ
		|					КОГДА Начисления.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоДневнойТарифнойСтавке)
		|							И Начисления.ВидТарифнойСтавки = ЗНАЧЕНИЕ(Перечисление.ВидыТарифныхСтавок.Дневная)
		|						ТОГДА ВЫБОР
		|								КОГДА Начисления.ТребуетВводаТарифногоРазряда
		|									ТОГДА ВЫБОР
		|											КОГДА Начисления.РазмерРазряда < Начисления.МинимальнаяТарифнаяСтавка
		|												ТОГДА ЛОЖЬ
		|											КОГДА Начисления.РазмерРазряда > Начисления.МаксимальнаяТарифнаяСтавка
		|												ТОГДА ЛОЖЬ
		|											ИНАЧЕ ИСТИНА
		|										КОНЕЦ
		|								ИНАЧЕ ВЫБОР
		|										КОГДА Начисления.Показатель1 < Начисления.МинимальнаяТарифнаяСтавка
		|											ТОГДА ЛОЖЬ
		|										КОГДА Начисления.Показатель1 > Начисления.МаксимальнаяТарифнаяСтавка
		|											ТОГДА ЛОЖЬ
		|										ИНАЧЕ ИСТИНА
		|									КОНЕЦ
		|							КОНЕЦ
		|					КОГДА Начисления.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоЧасовойТарифнойСтавке)
		|							И Начисления.ВидТарифнойСтавки = ЗНАЧЕНИЕ(Перечисление.ВидыТарифныхСтавок.Часовая)
		|						ТОГДА ВЫБОР
		|								КОГДА Начисления.ТребуетВводаТарифногоРазряда
		|									ТОГДА ВЫБОР
		|											КОГДА Начисления.РазмерРазряда < Начисления.МинимальнаяТарифнаяСтавка
		|												ТОГДА ЛОЖЬ
		|											КОГДА Начисления.РазмерРазряда > Начисления.МаксимальнаяТарифнаяСтавка
		|												ТОГДА ЛОЖЬ
		|											ИНАЧЕ ИСТИНА
		|										КОНЕЦ
		|								ИНАЧЕ ВЫБОР
		|										КОГДА Начисления.Показатель1 < Начисления.МинимальнаяТарифнаяСтавка
		|											ТОГДА ЛОЖЬ
		|										КОГДА Начисления.Показатель1 > Начисления.МаксимальнаяТарифнаяСтавка
		|											ТОГДА ЛОЖЬ
		|										ИНАЧЕ ИСТИНА
		|									КОНЕЦ
		|							КОНЕЦ
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК РазмерСоответствуетШТР,
		|	Показатели.Показатель1ЗапрашиватьПриКадровыхПеремещениях КАК Показатель1ЗапрашиватьПриКадровыхПеремещениях,
		|	Показатели.Показатель2ЗапрашиватьПриКадровыхПеремещениях КАК Показатель2ЗапрашиватьПриКадровыхПеремещениях,
		|	Показатели.Показатель3ЗапрашиватьПриКадровыхПеремещениях КАК Показатель3ЗапрашиватьПриКадровыхПеремещениях,
		|	Показатели.Показатель4ЗапрашиватьПриКадровыхПеремещениях КАК Показатель4ЗапрашиватьПриКадровыхПеремещениях,
		|	Показатели.Показатель5ЗапрашиватьПриКадровыхПеремещениях КАК Показатель5ЗапрашиватьПриКадровыхПеремещениях,
		|	Показатели.Показатель6ЗапрашиватьПриКадровыхПеремещениях КАК Показатель6ЗапрашиватьПриКадровыхПеремещениях,
		|	Начисления.ВидРасчета.ЗачетОтработанногоВремени КАК ЗачетОтработанногоВремени
		|ИЗ
		|	(ВЫБРАТЬ
		|		ТЧОсновныеНачисления.НомерСтроки КАК НомерСтроки,
		|		ТЧОсновныеНачисления.Сотрудник КАК Сотрудник,
		|		ТЧОсновныеНачисления.ВидРасчета КАК ВидРасчета,
		|		ТЧОсновныеНачисления.ВидРасчета.ПроизвольнаяФормулаРасчета КАК ПроизвольнаяФормулаРасчета,
		|		ВЫБОР
		|			КОГДА ТЧОсновныеНачисления.ВидРасчета.ЗачетОтработанногоВремени
		|				ТОГДА НЕОПРЕДЕЛЕНО
		|			ИНАЧЕ ТЧОсновныеНачисления.ВидРасчета
		|		КОНЕЦ КАК ВидРасчетаИзмерение,
		|		НЕОПРЕДЕЛЕНО КАК ДокументОснование,
		|		ТЧОсновныеНачисления.ВидРасчета.СпособРасчета КАК СпособРасчета,
		|		ТЧОсновныеНачисления.ВидРасчета.ЗачетОтработанногоВремени КАК ОсновноеНачисление,
		|		ТЧОсновныеНачисления.ВидРасчета.ТребуетВводаТарифногоРазряда КАК ТребуетВводаТарифногоРазряда,
		|		ТЧОсновныеНачисления.Действие КАК Действие,
		|		ТЧОсновныеНачисления.ДатаДействия КАК ДатаДействия,
		|		ТЧОсновныеНачисления.ДатаДействияКонец КАК ДатаДействияКонец,
		|		ТЧОсновныеНачисления.Показатель1 КАК Показатель1,
		|		ТЧОсновныеНачисления.ТарифныйРазряд1 КАК ТарифныйРазряд1,
		|		ТЧОсновныеНачисления.Валюта1 КАК Валюта1,
		|		ТЧОсновныеНачисления.Показатель2 КАК Показатель2,
		|		ТЧОсновныеНачисления.ТарифныйРазряд2 КАК ТарифныйРазряд2,
		|		ТЧОсновныеНачисления.Валюта2 КАК Валюта2,
		|		ТЧОсновныеНачисления.Показатель3 КАК Показатель3,
		|		ТЧОсновныеНачисления.ТарифныйРазряд3 КАК ТарифныйРазряд3,
		|		ТЧОсновныеНачисления.Валюта3 КАК Валюта3,
		|		ТЧОсновныеНачисления.Показатель4 КАК Показатель4,
		|		ТЧОсновныеНачисления.ТарифныйРазряд4 КАК ТарифныйРазряд4,
		|		ТЧОсновныеНачисления.Валюта4 КАК Валюта4,
		|		ТЧОсновныеНачисления.Показатель5 КАК Показатель5,
		|		ТЧОсновныеНачисления.ТарифныйРазряд5 КАК ТарифныйРазряд5,
		|		ТЧОсновныеНачисления.Валюта5 КАК Валюта5,
		|		ТЧОсновныеНачисления.Показатель6 КАК Показатель6,
		|		ТЧОсновныеНачисления.ТарифныйРазряд6 КАК ТарифныйРазряд6,
		|		ТЧОсновныеНачисления.Валюта6 КАК Валюта6,
		|		МИНИМУМ(ПовторяющиесяСтроки.НомерСтроки) КАК КонфликтнаяСтрокаНомер,
		|		МАКСИМУМ(ШтатноеРасписаниеОрганизаций.ЗанимаемыхСтавок) КАК ЗанимаемыхСтавок,
		|		ШтатноеРасписаниеОрганизаций.МинимальнаяТарифнаяСтавка КАК МинимальнаяТарифнаяСтавка,
		|		ШтатноеРасписаниеОрганизаций.МаксимальнаяТарифнаяСтавка КАК МаксимальнаяТарифнаяСтавка,
		|		ШтатноеРасписаниеОрганизаций.ВидТарифнойСтавки КАК ВидТарифнойСтавки,
		|		ШтатноеРасписаниеОрганизаций.РазмерРазряда КАК РазмерРазряда
		|	ИЗ
		|		Документ.ВводСведенийОПлановыхНачисленияхРаботниковОрганизаций.ОсновныеНачисления КАК ТЧОсновныеНачисления
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВводСведенийОПлановыхНачисленияхРаботниковОрганизаций.ОсновныеНачисления КАК ПовторяющиесяСтроки
		|			ПО ТЧОсновныеНачисления.Ссылка = ПовторяющиесяСтроки.Ссылка
		|				И ТЧОсновныеНачисления.НомерСтроки < ПовторяющиесяСтроки.НомерСтроки
		|				И (ТЧОсновныеНачисления.ВидРасчета = ПовторяющиесяСтроки.ВидРасчета
		|					ИЛИ ТЧОсновныеНачисления.ВидРасчета.ЗачетОтработанногоВремени
		|						И ПовторяющиесяСтроки.ВидРасчета.ЗачетОтработанногоВремени)
		|				И ТЧОсновныеНачисления.ДатаДействия = ПовторяющиесяСтроки.ДатаДействия
		|				И ТЧОсновныеНачисления.Сотрудник = ПовторяющиесяСтроки.Сотрудник
		|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				ДатыШтатногоРасписания.НомерСтроки КАК НомерСтроки,
		|				ДатыШтатногоРасписания.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|				ДатыШтатногоРасписания.Должность КАК Должность,
		|				ДатыШтатногоРасписания.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
		|				ШтатноеРасписаниеОрганизаций.МинимальнаяТарифнаяСтавка КАК МинимальнаяТарифнаяСтавка,
		|				ШтатноеРасписаниеОрганизаций.МаксимальнаяТарифнаяСтавка КАК МаксимальнаяТарифнаяСтавка,
		|				ШтатноеРасписаниеОрганизаций.ВидТарифнойСтавки КАК ВидТарифнойСтавки,
		|				РазмерТарифныхСтавок.Размер КАК РазмерРазряда
		|			ИЗ
		|				(ВЫБРАТЬ
		|					ДанныеРаботников.НомерСтроки КАК НомерСтроки,
		|					ДанныеРаботников.Сотрудник КАК Сотрудник,
		|					ДанныеРаботников.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|					ДанныеРаботников.Должность КАК Должность,
		|					МАКСИМУМ(ШтатноеРасписаниеОрганизаций.Период) КАК Период,
		|					ДанныеРаботников.ТарифныйРазряд КАК ТарифныйРазряд,
		|					МАКСИМУМ(ДанныеРаботников.ЗанимаемыхСтавок) КАК ЗанимаемыхСтавок,
		|					МАКСИМУМ(РазмерТарифныхСтавок.Период) КАК ПериодРазряда
		|				ИЗ
		|					(ВЫБРАТЬ
		|						ДатыРаботников.НомерСтроки КАК НомерСтроки,
		|						ДатыРаботников.Сотрудник КАК Сотрудник,
		|						ВЫБОР
		|							КОГДА ДатыРаботников.ДатаДействия >= РаботникиОрганизации.ПериодЗавершения
		|									И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|								ТОГДА РаботникиОрганизации.ПодразделениеОрганизацииЗавершения
		|							ИНАЧЕ РаботникиОрганизации.ПодразделениеОрганизации
		|						КОНЕЦ КАК ПодразделениеОрганизации,
		|						ВЫБОР
		|							КОГДА ДатыРаботников.ДатаДействия >= РаботникиОрганизации.ПериодЗавершения
		|									И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|								ТОГДА РаботникиОрганизации.ДолжностьЗавершения
		|							ИНАЧЕ РаботникиОрганизации.Должность
		|						КОНЕЦ КАК Должность,
		|						ДатыРаботников.ДатаДействия КАК ДатаДействия,
		|						РаботникиОрганизации.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
		|						ДатыРаботников.ТарифныйРазряд КАК ТарифныйРазряд
		|					ИЗ
		|						(ВЫБРАТЬ
		|							ВводСведенийОПлановыхНачисленияхРаботниковОрганизацииОсновныеНачисления.НомерСтроки КАК НомерСтроки,
		|							ВводСведенийОПлановыхНачисленияхРаботниковОрганизацииОсновныеНачисления.Сотрудник КАК Сотрудник,
		|							МАКСИМУМ(РаботникиОрганизации.ЗанимаемыхСтавок) КАК ЗанимаемыхСтавок,
		|							МАКСИМУМ(РаботникиОрганизации.Период) КАК Период,
		|							ВводСведенийОПлановыхНачисленияхРаботниковОрганизацииОсновныеНачисления.ДатаДействия КАК ДатаДействия,
		|							ВводСведенийОПлановыхНачисленияхРаботниковОрганизацииОсновныеНачисления.ТарифныйРазряд1 КАК ТарифныйРазряд
		|						ИЗ
		|							Документ.ВводСведенийОПлановыхНачисленияхРаботниковОрганизаций.ОсновныеНачисления КАК ВводСведенийОПлановыхНачисленияхРаботниковОрганизацииОсновныеНачисления
		|								ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизации
		|								ПО ВводСведенийОПлановыхНачисленияхРаботниковОрганизацииОсновныеНачисления.ДатаДействия >= РаботникиОрганизации.Период
		|									И ВводСведенийОПлановыхНачисленияхРаботниковОрганизацииОсновныеНачисления.Сотрудник = РаботникиОрганизации.Сотрудник
		|						ГДЕ
		|							ВводСведенийОПлановыхНачисленияхРаботниковОрганизацииОсновныеНачисления.Ссылка = &ДокументСсылка
		|						
		|						СГРУППИРОВАТЬ ПО
		|							ВводСведенийОПлановыхНачисленияхРаботниковОрганизацииОсновныеНачисления.НомерСтроки,
		|							ВводСведенийОПлановыхНачисленияхРаботниковОрганизацииОсновныеНачисления.ДатаДействия,
		|							ВводСведенийОПлановыхНачисленияхРаботниковОрганизацииОсновныеНачисления.ТарифныйРазряд1,
		|							ВводСведенийОПлановыхНачисленияхРаботниковОрганизацииОсновныеНачисления.Сотрудник) КАК ДатыРаботников
		|							ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизации
		|							ПО ДатыРаботников.Период = РаботникиОрганизации.Период
		|								И ДатыРаботников.Сотрудник = РаботникиОрганизации.Сотрудник) КАК ДанныеРаботников
		|						ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтатноеРасписаниеОрганизаций КАК ШтатноеРасписаниеОрганизаций
		|						ПО ДанныеРаботников.ПодразделениеОрганизации = ШтатноеРасписаниеОрганизаций.ПодразделениеОрганизации
		|							И ДанныеРаботников.Должность = ШтатноеРасписаниеОрганизаций.Должность
		|							И ДанныеРаботников.ДатаДействия >= ШтатноеРасписаниеОрганизаций.Период
		|						ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмерТарифныхСтавок КАК РазмерТарифныхСтавок
		|						ПО ДанныеРаботников.ДатаДействия >= РазмерТарифныхСтавок.Период
		|							И ДанныеРаботников.ТарифныйРазряд >= РазмерТарифныхСтавок.ТарифныйРазряд
		|				
		|				СГРУППИРОВАТЬ ПО
		|					ДанныеРаботников.НомерСтроки,
		|					ДанныеРаботников.ПодразделениеОрганизации,
		|					ДанныеРаботников.Должность,
		|					ДанныеРаботников.ТарифныйРазряд,
		|					ДанныеРаботников.Сотрудник) КАК ДатыШтатногоРасписания
		|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтатноеРасписаниеОрганизаций КАК ШтатноеРасписаниеОрганизаций
		|					ПО ДатыШтатногоРасписания.ПодразделениеОрганизации = ШтатноеРасписаниеОрганизаций.ПодразделениеОрганизации
		|						И ДатыШтатногоРасписания.Должность = ШтатноеРасписаниеОрганизаций.Должность
		|						И ДатыШтатногоРасписания.Период = ШтатноеРасписаниеОрганизаций.Период
		|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмерТарифныхСтавок КАК РазмерТарифныхСтавок
		|					ПО ДатыШтатногоРасписания.Период = РазмерТарифныхСтавок.Период
		|						И ДатыШтатногоРасписания.ТарифныйРазряд = РазмерТарифныхСтавок.ТарифныйРазряд) КАК ШтатноеРасписаниеОрганизаций
		|			ПО ТЧОсновныеНачисления.НомерСтроки = ШтатноеРасписаниеОрганизаций.НомерСтроки
		|	ГДЕ
		|		ТЧОсновныеНачисления.Ссылка = &ДокументСсылка
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ТЧОсновныеНачисления.НомерСтроки,
		|		ТЧОсновныеНачисления.ВидРасчета,
		|		ТЧОсновныеНачисления.Действие,
		|		ТЧОсновныеНачисления.ДатаДействия,
		|		ТЧОсновныеНачисления.ДатаДействияКонец,
		|		ТЧОсновныеНачисления.Показатель1,
		|		ТЧОсновныеНачисления.ТарифныйРазряд1,
		|		ТЧОсновныеНачисления.Валюта1,
		|		ТЧОсновныеНачисления.Показатель2,
		|		ТЧОсновныеНачисления.ТарифныйРазряд2,
		|		ТЧОсновныеНачисления.Валюта2,
		|		ТЧОсновныеНачисления.Показатель3,
		|		ТЧОсновныеНачисления.ТарифныйРазряд3,
		|		ТЧОсновныеНачисления.Валюта3,
		|		ТЧОсновныеНачисления.Показатель4,
		|		ТЧОсновныеНачисления.ТарифныйРазряд4,
		|		ТЧОсновныеНачисления.Валюта4,
		|		ТЧОсновныеНачисления.Показатель5,
		|		ТЧОсновныеНачисления.ТарифныйРазряд5,
		|		ТЧОсновныеНачисления.Валюта5,
		|		ТЧОсновныеНачисления.Показатель6,
		|		ТЧОсновныеНачисления.ТарифныйРазряд6,
		|		ТЧОсновныеНачисления.Валюта6,
		|		ШтатноеРасписаниеОрганизаций.МинимальнаяТарифнаяСтавка,
		|		ШтатноеРасписаниеОрганизаций.МаксимальнаяТарифнаяСтавка,
		|		ШтатноеРасписаниеОрганизаций.ВидТарифнойСтавки,
		|		ШтатноеРасписаниеОрганизаций.РазмерРазряда,
		|		ТЧОсновныеНачисления.Сотрудник,
		|		ТЧОсновныеНачисления.ВидРасчета.СпособРасчета,
		|		ТЧОсновныеНачисления.ВидРасчета.ЗачетОтработанногоВремени,
		|		ТЧОсновныеНачисления.ВидРасчета.ТребуетВводаТарифногоРазряда,
		|		ТЧОсновныеНачисления.ВидРасчета.ПроизвольнаяФормулаРасчета) КАК Начисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций КАК СуществующиеДвижения
		|		ПО Начисления.ДатаДействия = СуществующиеДвижения.Период
		|			И Начисления.ВидРасчетаИзмерение = СуществующиеДвижения.ВидРасчетаИзмерение
		|			И Начисления.Сотрудник = СуществующиеДвижения.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПоказатели КАК Показатели
		|		ПО Начисления.ВидРасчета = Показатели.ВидРасчета";
		
	Иначе
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	Начисления.НомерСтроки,
		|	Начисления.Сотрудник,
		|	Начисления.Сотрудник.Наименование,
		|	Начисления.ВидРасчета,
		|	Начисления.ПроизвольнаяФормулаРасчета,
		|	Начисления.ДокументОснование,
		|	ЕСТЬNULL(Начисления.ТребуетВводаТарифногоРазряда, ЛОЖЬ) КАК ТребуетВводаТарифногоРазряда,
		|	Начисления.СпособРасчета,
		|	Начисления.ОсновноеНачисление,
		|	Начисления.Действие,
		|	Начисления.ДатаДействия,
		|	Начисления.ДатаДействияКонец,
		|	Начисления.ТарифныйРазряд1,
		|	Начисления.Показатель1,
		|	Начисления.Валюта1,
		|	Начисления.ТарифныйРазряд2,
		|	Начисления.Показатель2,
		|	Начисления.Валюта2,
		|	Начисления.ТарифныйРазряд3,
		|	Начисления.Показатель3,
		|	Начисления.Валюта3,
		|	Начисления.ТарифныйРазряд4,
		|	Начисления.Показатель4,
		|	Начисления.Валюта4,
		|	Начисления.ТарифныйРазряд5,
		|	Начисления.Показатель5,
		|	Начисления.Валюта5,
		|	Начисления.ТарифныйРазряд6,
		|	Начисления.Показатель6,
		|	Начисления.Валюта6,
		|	ЕСТЬNULL(Показатели.КоличествоПоказателей, 0) КАК КоличествоПоказателей,
		|	Показатели.Показатель1Предопределенный,
		|	Показатели.Показатель1Наименование,
		|	Показатели.Показатель1ТипПоказателя,
		|	Показатели.Показатель1ВозможностьИзменения,
		|	Показатели.Показатель2Предопределенный,
		|	Показатели.Показатель2Наименование,
		|	Показатели.Показатель2ТипПоказателя,
		|	Показатели.Показатель2ВозможностьИзменения,
		|	Показатели.Показатель3Предопределенный,
		|	Показатели.Показатель3Наименование,
		|	Показатели.Показатель3ТипПоказателя,
		|	Показатели.Показатель3ВозможностьИзменения,
		|	Показатели.Показатель4Предопределенный,
		|	Показатели.Показатель4Наименование,
		|	Показатели.Показатель4ТипПоказателя,
		|	Показатели.Показатель4ВозможностьИзменения,
		|	Показатели.Показатель5Предопределенный,
		|	Показатели.Показатель5Наименование,
		|	Показатели.Показатель5ТипПоказателя,
		|	Показатели.Показатель5ВозможностьИзменения,
		|	Показатели.Показатель6Предопределенный,
		|	Показатели.Показатель6Наименование,
		|	Показатели.Показатель6ТипПоказателя,
		|	Показатели.Показатель6ВозможностьИзменения,
		|	Показатели.Показатель1ТарифнаяСтавка,
		|	Показатели.Показатель2ТарифнаяСтавка,
		|	Показатели.Показатель3ТарифнаяСтавка,
		|	Показатели.Показатель4ТарифнаяСтавка,
		|	Показатели.Показатель5ТарифнаяСтавка,
		|	Показатели.Показатель6ТарифнаяСтавка,
		|	ВЫБОР
		|		КОГДА Начисления.Сотрудник.Организация = &ГоловнаяОрганизация
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ОшибкаНеСоответствиеСотрудникаИОрганизации,
		|	Начисления.КонфликтнаяСтрокаНомер,
		|	СуществующиеДвижения.Регистратор.Представление КАК КонфликтныйДокумент,
		|	Показатели.Показатель1ЗапрашиватьПриКадровыхПеремещениях КАК Показатель1ЗапрашиватьПриКадровыхПеремещениях,
		|	Показатели.Показатель2ЗапрашиватьПриКадровыхПеремещениях КАК Показатель2ЗапрашиватьПриКадровыхПеремещениях,
		|	Показатели.Показатель3ЗапрашиватьПриКадровыхПеремещениях КАК Показатель3ЗапрашиватьПриКадровыхПеремещениях,
		|	Показатели.Показатель4ЗапрашиватьПриКадровыхПеремещениях КАК Показатель4ЗапрашиватьПриКадровыхПеремещениях,
		|	Показатели.Показатель5ЗапрашиватьПриКадровыхПеремещениях КАК Показатель5ЗапрашиватьПриКадровыхПеремещениях,
		|	Показатели.Показатель6ЗапрашиватьПриКадровыхПеремещениях КАК Показатель6ЗапрашиватьПриКадровыхПеремещениях,
		|	Начисления.ВидРасчета.ЗачетОтработанногоВремени КАК ЗачетОтработанногоВремени
		|ИЗ
		|	(ВЫБРАТЬ
		|		ТЧОсновныеНачисления.НомерСтроки КАК НомерСтроки,
		|		ТЧОсновныеНачисления.Сотрудник КАК Сотрудник,
		|		ТЧОсновныеНачисления.ВидРасчета КАК ВидРасчета,
		|		ТЧОсновныеНачисления.ВидРасчета.ПроизвольнаяФормулаРасчета КАК ПроизвольнаяФормулаРасчета,
		//vvv
		//|		ВЫБОР
		//|			КОГДА ТЧОсновныеНачисления.ВидРасчета.ЗачетОтработанногоВремени
		//|				ТОГДА НЕОПРЕДЕЛЕНО
		//|			ИНАЧЕ ТЧОсновныеНачисления.ВидРасчета
		//|		КОНЕЦ КАК ВидРасчетаИзмерение,
		|		ВЫБОР
		|			КОГДА ТЧОсновныеНачисления.ВидРасчета.ЗачетОтработанногоВремени И ТЧОсновныеНачисления.ВидРасчета.ЗачетНормыВремени
		|				ТОГДА НЕОПРЕДЕЛЕНО
		|			ИНАЧЕ ТЧОсновныеНачисления.ВидРасчета
		|		КОНЕЦ КАК ВидРасчетаИзмерение,
		|		НЕОПРЕДЕЛЕНО КАК ДокументОснование,
		|		ТЧОсновныеНачисления.ВидРасчета.СпособРасчета КАК СпособРасчета,
		//vvv
	//	|		ТЧОсновныеНачисления.ВидРасчета.ЗачетОтработанногоВремени КАК ОсновноеНачисление,
	    |		ВЫБОР
		|			КОГДА ТЧОсновныеНачисления.ВидРасчета.ЗачетОтработанногоВремени И ТЧОсновныеНачисления.ВидРасчета.ЗачетНормыВремени
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ КАК ОсновноеНачисление,
		//
		|		ТЧОсновныеНачисления.ВидРасчета.ТребуетВводаТарифногоРазряда КАК ТребуетВводаТарифногоРазряда,
		|		ТЧОсновныеНачисления.Действие КАК Действие,
		|		ТЧОсновныеНачисления.ДатаДействия КАК ДатаДействия,
		|		ТЧОсновныеНачисления.ДатаДействияКонец КАК ДатаДействияКонец,
		|		ТЧОсновныеНачисления.Показатель1 КАК Показатель1,
		|		ТЧОсновныеНачисления.ТарифныйРазряд1 КАК ТарифныйРазряд1,
		|		ТЧОсновныеНачисления.Валюта1 КАК Валюта1,
		|		ТЧОсновныеНачисления.Показатель2 КАК Показатель2,
		|		ТЧОсновныеНачисления.ТарифныйРазряд2 КАК ТарифныйРазряд2,
		|		ТЧОсновныеНачисления.Валюта2 КАК Валюта2,
		|		ТЧОсновныеНачисления.Показатель3 КАК Показатель3,
		|		ТЧОсновныеНачисления.ТарифныйРазряд3 КАК ТарифныйРазряд3,
		|		ТЧОсновныеНачисления.Валюта3 КАК Валюта3,
		|		ТЧОсновныеНачисления.Показатель4 КАК Показатель4,
		|		ТЧОсновныеНачисления.ТарифныйРазряд4 КАК ТарифныйРазряд4,
		|		ТЧОсновныеНачисления.Валюта4 КАК Валюта4,
		|		ТЧОсновныеНачисления.Показатель5 КАК Показатель5,
		|		ТЧОсновныеНачисления.ТарифныйРазряд5 КАК ТарифныйРазряд5,
		|		ТЧОсновныеНачисления.Валюта5 КАК Валюта5,
		|		ТЧОсновныеНачисления.Показатель6 КАК Показатель6,
		|		ТЧОсновныеНачисления.ТарифныйРазряд6 КАК ТарифныйРазряд6,
		|		ТЧОсновныеНачисления.Валюта6 КАК Валюта6,
		|		МИНИМУМ(ПовторяющиесяСтроки.НомерСтроки) КАК КонфликтнаяСтрокаНомер
		|	ИЗ
		|		Документ.ВводСведенийОПлановыхНачисленияхРаботниковОрганизаций.ОсновныеНачисления КАК ТЧОсновныеНачисления
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВводСведенийОПлановыхНачисленияхРаботниковОрганизаций.ОсновныеНачисления КАК ПовторяющиесяСтроки
		|			ПО ТЧОсновныеНачисления.Ссылка = ПовторяющиесяСтроки.Ссылка
		|				И ТЧОсновныеНачисления.НомерСтроки < ПовторяющиесяСтроки.НомерСтроки
		|				И (ТЧОсновныеНачисления.ВидРасчета = ПовторяющиесяСтроки.ВидРасчета
		|					ИЛИ ТЧОсновныеНачисления.ВидРасчета.ЗачетОтработанногоВремени
		|						И ПовторяющиесяСтроки.ВидРасчета.ЗачетОтработанногоВремени)
		|				И ТЧОсновныеНачисления.ДатаДействия = ПовторяющиесяСтроки.ДатаДействия
		|				И ТЧОсновныеНачисления.Сотрудник = ПовторяющиесяСтроки.Сотрудник
		|	ГДЕ
		|		ТЧОсновныеНачисления.Ссылка = &ДокументСсылка
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ТЧОсновныеНачисления.НомерСтроки,
		|		ТЧОсновныеНачисления.ВидРасчета,
		|		ТЧОсновныеНачисления.Действие,
		|		ТЧОсновныеНачисления.ДатаДействия,
		|		ТЧОсновныеНачисления.ДатаДействияКонец,
		|		ТЧОсновныеНачисления.Показатель1,
		|		ТЧОсновныеНачисления.ТарифныйРазряд1,
		|		ТЧОсновныеНачисления.Валюта1,
		|		ТЧОсновныеНачисления.Показатель2,
		|		ТЧОсновныеНачисления.ТарифныйРазряд2,
		|		ТЧОсновныеНачисления.Валюта2,
		|		ТЧОсновныеНачисления.Показатель3,
		|		ТЧОсновныеНачисления.ТарифныйРазряд3,
		|		ТЧОсновныеНачисления.Валюта3,
		|		ТЧОсновныеНачисления.Показатель4,
		|		ТЧОсновныеНачисления.ТарифныйРазряд4,
		|		ТЧОсновныеНачисления.Валюта4,
		|		ТЧОсновныеНачисления.Показатель5,
		|		ТЧОсновныеНачисления.ТарифныйРазряд5,
		|		ТЧОсновныеНачисления.Валюта5,
		|		ТЧОсновныеНачисления.Показатель6,
		|		ТЧОсновныеНачисления.ТарифныйРазряд6,
		|		ТЧОсновныеНачисления.Валюта6,
		|		ТЧОсновныеНачисления.Сотрудник,
		|		ТЧОсновныеНачисления.ВидРасчета.СпособРасчета,
		|		ТЧОсновныеНачисления.ВидРасчета.ЗачетОтработанногоВремени,
		|		ТЧОсновныеНачисления.ВидРасчета.ТребуетВводаТарифногоРазряда,
		|		ТЧОсновныеНачисления.ВидРасчета.ПроизвольнаяФормулаРасчета) КАК Начисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций КАК СуществующиеДвижения
		|		ПО Начисления.ДатаДействия = СуществующиеДвижения.Период
		|			И Начисления.ВидРасчетаИзмерение = СуществующиеДвижения.ВидРасчетаИзмерение
		|			И Начисления.Сотрудник = СуществующиеДвижения.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПоказатели КАК Показатели
		|		ПО Начисления.ВидРасчета = Показатели.ВидРасчета";
		
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;	
	
	Возврат Запрос.Выполнить();

КонецФункции // СформироватьЗапросПоРаботникиОрганизации()

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по шапке,
// все проверяемые реквизиты должны быть включены в выборку по шапке.
//
// Параметры:
//  ВыборкаПоШапкеДокумента	- выборка из результата запроса по шапке документа,
//  Отказ					- флаг отказа в проведении.
//	Заголовок				- Заголовок для сообщений об ошибках проведения
//
Процедура ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок)

	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.Организация) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана организация!", Отказ, Заголовок);
	КонецЕсли;

КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Проверяет правильность заполнения реквизитов в строке ТЧ "РаботникиОрганизации" документа.
// Если какой-то из реквизтов, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по строке ТЧ документа,
// все проверяемые реквизиты должны быть включены в выборку.
//
// Параметры: 
//  ВыборкаПоШапкеДокумента		- выборка из результата запроса по шапке документа,
//  ВыборкаПоСтрокамДокумента	- спозиционированная на определеной строке выборка 
//  							  из результата запроса
//  Отказ						- флаг отказа в проведении.
//
Процедура ПроверитьЗаполнениеСтрокиРаботникаОрганизации(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, Отказ, Заголовок, ПроверкаШтатногоРасписания)

	СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(ВыборкаПоСтрокамДокумента.НомерСтроки) +
									""" табл. части ""Плановые начисления"": ";
	
	// Сотрудник
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Сотрудник) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не выбран сотрудник!", Отказ, Заголовок);
	КонецЕсли;

	// Организация сотрудника должна совпадать с организацией документа
	Если ВыборкаПоСтрокамДокумента.ОшибкаНеСоответствиеСотрудникаИОрганизации Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "указанный сотрудник оформлен на другую организацию!", Отказ, Заголовок);
	КонецЕсли;
	
	// Действие
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Действие) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не задано действие!", Отказ, Заголовок);
	КонецЕсли;
	
	Если ВыборкаПоСтрокамДокумента.Действие <> Перечисления.ВидыДействияСНачислением.НеИзменять Тогда
		
		// Вид расчета
		Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ВидРасчета) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не задан вид расчета!", Отказ, Заголовок);
		ИначеЕсли (ВыборкаПоСтрокамДокумента.Действие = Перечисления.ВидыДействияСНачислением.Начать ИЛИ ВыборкаПоСтрокамДокумента.Действие = Перечисления.ВидыДействияСНачислением.Изменить) Тогда
			
			// Соответствие размера "основного" начисления штатному расписанию
			Если ПроверкаШтатногоРасписания И Не ВыборкаПоСтрокамДокумента.РазмерСоответствуетШТР И Не ВыборкаПоСтрокамДокумента.ТребуетВводаТарифногоРазряда Тогда
				ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "размер основного начисления не соответствует штатному расписанию!", Отказ, Заголовок);
			КонецЕсли;
		КонецЕсли;
		
		// ДатаДействия
		Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДатаДействия) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не задана дата действия!", Отказ, Заголовок);
		ИначеЕсли ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.КонфликтныйДокумент) Тогда
			// Движения в регистре на дату из документа
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "на дату "+ ВыборкаПоСтрокамДокумента.ДатаДействия + " начисление уже зарегистрировано документом " + ВыборкаПоСтрокамДокумента.КонфликтныйДокумент + "!", Отказ, Заголовок);
		КонецЕсли;
		
		// Период действия
		Если ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДатаДействияКонец) И ВыборкаПоСтрокамДокумента.ДатаДействия > ВыборкаПоСтрокамДокумента.ДатаДействияКонец Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "дата окончания действия не должна быть меньше даты начала!", Отказ, Заголовок);
		КонецЕсли; 
		
		// Одинаковые строки
		Если ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.КонфликтнаяСтрокаНомер) Тогда
			Если ВыборкаПоСтрокамДокумента.ОсновноеНачисление Тогда
				СтрокаСообщениеОбОшибке = "основное начисление работника " + ВыборкаПоСтрокамДокумента.СотрудникНаименование + " следует редактировать в одной строке (см. строку " + ВыборкаПоСтрокамДокумента.КонфликтнаяСтрокаНомер + ")!"; 
			Иначе
				СтрокаСообщениеОбОшибке = "работнику " + ВыборкаПоСтрокамДокумента.СотрудникНаименование + " не может быть назначено одно и тоже начисление дважды (см. строку " + ВыборкаПоСтрокамДокумента.КонфликтнаяСтрокаНомер + ")!"; 
			КонецЕсли;
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке  + СтрокаСообщениеОбОшибке, Отказ, Заголовок);
		КонецЕсли;
		
		Если ВыборкаПоСтрокамДокумента.Действие = Перечисления.ВидыДействияСНачислением.Начать или ВыборкаПоСтрокамДокумента.Действие = Перечисления.ВидыДействияСНачислением.Изменить Тогда
			ИспользуютсяНачисленияВВалюте			= ПроцедурыУправленияПерсоналом.ЗначениеУчетнойПолитикиПоПерсоналуОрганизации(глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналуОрганизации"), Организация, "ИспользуютсяНачисленияВВалюте");
			ПроведениеРасчетов.ПроверкаПоказателейВПлановыхНачислениях(ВыборкаПоСтрокамДокумента, СтрокаНачалаСообщенияОбОшибке, Истина, Отказ, Заголовок, ИспользуютсяНачисленияВВалюте, СоответствиеВалютныеСпособыРасчета);
		КонецЕсли;

				
	КонецЕсли;
		
КонецПроцедуры // ПроверитьЗаполнениеСтрокиРаботникаОрганизации()

// По строке выборки результата запроса по документу формируем движения по регистрам
//
// Параметры: 
//  ВыборкаПоШапкеДокумента					- выборка из результата запроса по шапке документа,
//
// Возвращаемое значение:
//  Нет.
//
Процедура ДобавитьСтрокуВДвиженияПоРегистрамСведений(ВыборкаПоШапкеДокумента, ВыборкаПоРаботникиОрганизации)

	Если ВыборкаПоРаботникиОрганизации.Действие <> Перечисления.ВидыДействияСНачислением.НеИзменять тогда
		
		Движение = Движения.ПлановыеНачисленияРаботниковОрганизаций.Добавить();
		
		// Свойства
		Движение.Период						= ВыборкаПоРаботникиОрганизации.ДатаДействия;
		
		// Измерения
		Движение.Сотрудник					= ВыборкаПоРаботникиОрганизации.Сотрудник;
		Движение.Организация				= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
		Если НЕ ВыборкаПоРаботникиОрганизации.ОсновноеНачисление Тогда
			Движение.ВидРасчетаИзмерение	= ВыборкаПоРаботникиОрганизации.ВидРасчета;
		КонецЕсли;
		Движение.ДокументОснование			= ВыборкаПоРаботникиОрганизации.ДокументОснование;
		
		// Ресурсы
		Движение.Действие					= ВыборкаПоРаботникиОрганизации.Действие;
		Движение.ВидРасчета					= ВыборкаПоРаботникиОрганизации.ВидРасчета;
		
		Если ВыборкаПоРаботникиОрганизации.Действие <> Перечисления.ВидыДействияСНачислением.Прекратить Тогда
			Для Сч = 1 По 6 Цикл
				Если ВыборкаПоРаботникиОрганизации.ПроизвольнаяФормулаРасчета Тогда
					Если Сч <= ВыборкаПоРаботникиОрганизации.КоличествоПоказателей Тогда
						Если ВыборкаПоРаботникиОрганизации["Показатель" + Сч + "ЗапрашиватьПриКадровыхПеремещениях"]
							Или ВыборкаПоРаботникиОрганизации["ЗачетОтработанногоВремени"] И ВыборкаПоРаботникиОрганизации["Показатель" + Сч + "ТарифнаяСтавка"] Тогда
							Движение["Показатель"+Сч]			= ВыборкаПоРаботникиОрганизации["Показатель"+Сч];
							Движение["Валюта"+Сч]				= ВыборкаПоРаботникиОрганизации["Валюта"+Сч];
							Движение["ТарифныйРазряд"+Сч]		= ВыборкаПоРаботникиОрганизации["ТарифныйРазряд"+Сч];
						Иначе
							Движение["Показатель"+Сч]			= 0;
							Движение["Валюта"+Сч]				= Справочники.Валюты.ПустаяСсылка();
							Движение["ТарифныйРазряд"+Сч]		= Справочники.ТарифныеРазряды.ПустаяСсылка();
						КонецЕсли;
					КонецЕсли;
				Иначе
					Движение["Показатель"+Сч]			= ВыборкаПоРаботникиОрганизации["Показатель"+Сч];
					Движение["Валюта"+Сч]				= ВыборкаПоРаботникиОрганизации["Валюта"+Сч];
					Движение["ТарифныйРазряд"+Сч]		= ВыборкаПоРаботникиОрганизации["ТарифныйРазряд"+Сч];
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		Если ВыборкаПоРаботникиОрганизации.Действие = Перечисления.ВидыДействияСНачислением.Начать 
			И ЗначениеЗаполнено(ВыборкаПоРаботникиОрганизации.ДатаДействияКонец) Тогда
			Движение.ПериодЗавершения		= ВыборкаПоРаботникиОрганизации.ДатаДействияКонец + мДлинаСуток;
			Движение.ДействиеЗавершения		= Перечисления.ВидыДействияСНачислением.Прекратить;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ДобавитьСтрокуВДвиженияПоРегистрамСведений()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	СоответствиеВалютныеСпособыРасчета = ПроведениеРасчетов.ПолучитьСоответствиеСпособовРасчетаТребующихВалюту();
	РезультатЗапросаПоШапке = СформироватьЗапросПоШапке(Режим);

	// Получим реквизиты шапки из запроса
	ВыборкаПоШапкеДокумента = РезультатЗапросаПоШапке.Выбрать();

	Если ВыборкаПоШапкеДокумента.Следующий() Тогда

		ПроверкаШтатногоРасписания = ПроцедурыУправленияПерсоналом.ЗначениеУчетнойПолитикиПоПерсоналуОрганизации(глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналуОрганизации"), Организация, "ПроверкаШтатногоРасписания");
		
		//Надо позвать проверку заполнения реквизитов шапки
		ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок);

		// Движения стоит добавлять, если в проведении еще не отказано (отказ =ложь)
		Если НЕ Отказ Тогда

			// получим реквизиты табличной части
			РезультатЗапросаПоРаботники = СформироватьЗапросПоРаботникиОрганизации(ВыборкаПоШапкеДокумента, ПроверкаШтатногоРасписания);
			ВыборкаПоРаботникиОрганизации = РезультатЗапросаПоРаботники.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			ПроверкаШтатногоРасписания = ПроцедурыУправленияПерсоналом.ЗначениеУчетнойПолитикиПоПерсоналуОрганизации(глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналуОрганизации"), Организация, "ПроверкаШтатногоРасписания");
			
			Пока ВыборкаПоРаботникиОрганизации.Следующий() Цикл
				
				// проверим очередную строку табличной части
				ПроверитьЗаполнениеСтрокиРаботникаОрганизации(ВыборкаПоШапкеДокумента, ВыборкаПоРаботникиОрганизации, Отказ, Заголовок, ПроверкаШтатногоРасписания);

				Если НЕ Отказ Тогда

					// Заполним записи в наборах записей регистров
					ДобавитьСтрокуВДвиженияПоРегистрамСведений(ВыборкаПоШапкеДокумента, ВыборкаПоРаботникиОрганизации);
					
				КонецЕсли;

			КонецЦикла;
			
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры // ОбработкаПроведения()

Процедура ОбработкаЗаполнения(Основание)

	ТипОснования = ТипЗнч(Основание);
	
	Если ТипОснования = Тип("СправочникСсылка.СотрудникиОрганизаций") Тогда
		
		// Заполним реквизиты из стандартного набора.
		ОбщегоНазначения.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);
		
		ДобавитьСтрокиНачисленийПоРаботнику(Основание, ОбщегоНазначения.ПолучитьРабочуюДату());
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Сотрудник", Основание);
		Запрос.УстановитьПараметр("ДатаАктуальности", ОбщегоНазначения.ПолучитьРабочуюДату());
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаАктуальности
		|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА РаботникиОрганизации.ОбособленноеПодразделениеЗавершения
		|		ИНАЧЕ РаботникиОрганизации.ОбособленноеПодразделение
		|	КОНЕЦ КАК Организация
		|ИЗ
		|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаАктуальности, Сотрудник = &Сотрудник) КАК РаботникиОрганизации";
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Организация = Выборка.Организация
		Иначе 
			Организация = Основание.ОбособленноеПодразделение
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаЗаполнения()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	КраткийСоставДокумента = ПроцедурыУправленияПерсоналом.ЗаполнитьКраткийСоставДокумента(ОсновныеНачисления);
	
КонецПроцедуры // ПередЗаписью()

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

мДлинаСуток = 86400;
